# OuterFillet Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionGeneralH..::..OuterFillet Property
StructuralSectionGeneralH Class See Also
---
Outer Fillet - Corner fillet outer radius.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double OuterFillet { get; set; }
```

Visual Basic
---
```text
Public Property OuterFillet As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double OuterFillet {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionGeneralH Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace